zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SAI.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_SAI.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_SAI
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_SAI_H_)  /* Check if memory map has not been already included */
#define S32K566_SAI_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- SAI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SAI_Peripheral_Access_Layer SAI Peripheral Access Layer
 * @{
 */

/** SAI - Size of Registers Arrays */
#define SAI_TDR_COUNT                             4u
#define SAI_TFR_COUNT                             4u
#define SAI_RDR_COUNT                             4u
#define SAI_RFR_COUNT                             4u

/** SAI - Register Layout Typedef */
typedef struct SAI_Struct {
  __I  uint32_t VERID;                             /**< Version ID, offset: 0x0 */
  __I  uint32_t PARAM;                             /**< Parameter, offset: 0x4 */
  __IO uint32_t TCSR;                              /**< Transmit Control, offset: 0x8 */
  __IO uint32_t TCR1;                              /**< Transmit Configuration 1, offset: 0xC */
  __IO uint32_t TCR2;                              /**< Transmit Configuration 2, offset: 0x10 */
  __IO uint32_t TCR3;                              /**< Transmit Configuration 3, offset: 0x14 */
  __IO uint32_t TCR4;                              /**< Transmit Configuration 4, offset: 0x18 */
  __IO uint32_t TCR5;                              /**< Transmit Configuration 5, offset: 0x1C */
  __IO uint32_t TDR[SAI_TDR_COUNT];                /**< Transmit Data, array offset: 0x20, array step: 0x4, irregular array, not all indices are valid */
  uint8_t RESERVED_0[16];
  __I  uint32_t TFR[SAI_TFR_COUNT];                /**< Transmit FIFO, array offset: 0x40, array step: 0x4, irregular array, not all indices are valid */
  uint8_t RESERVED_1[16];
  __IO uint32_t TMR;                               /**< Transmit Mask, offset: 0x60 */
  uint8_t RESERVED_2[12];
  __IO uint32_t TTCR;                              /**< Transmit Timestamp Control, offset: 0x70 */
  __I  uint32_t TTSR;                              /**< Transmit Timestamp, offset: 0x74 */
  __I  uint32_t TBCR;                              /**< Transmit Bit Count, offset: 0x78 */
  __I  uint32_t TBCTR;                             /**< Transmit Bit Count Timestamp, offset: 0x7C */
  uint8_t RESERVED_3[8];
  __IO uint32_t RCSR;                              /**< Receive Control, offset: 0x88 */
  __IO uint32_t RCR1;                              /**< Receive Configuration 1, offset: 0x8C */
  __IO uint32_t RCR2;                              /**< Receive Configuration 2, offset: 0x90 */
  __IO uint32_t RCR3;                              /**< Receive Configuration 3, offset: 0x94 */
  __IO uint32_t RCR4;                              /**< Receive Configuration 4, offset: 0x98 */
  __IO uint32_t RCR5;                              /**< Receive Configuration 5, offset: 0x9C */
  __I  uint32_t RDR[SAI_RDR_COUNT];                /**< Receive Data, array offset: 0xA0, array step: 0x4, irregular array, not all indices are valid */
  uint8_t RESERVED_4[16];
  __I  uint32_t RFR[SAI_RFR_COUNT];                /**< Receive FIFO, array offset: 0xC0, array step: 0x4, irregular array, not all indices are valid */
  uint8_t RESERVED_5[16];
  __IO uint32_t RMR;                               /**< Receive Mask, offset: 0xE0 */
  uint8_t RESERVED_6[12];
  __IO uint32_t RTCR;                              /**< Receive Timestamp Control, offset: 0xF0 */
  __I  uint32_t RTSR;                              /**< Receive Timestamp, offset: 0xF4 */
  __I  uint32_t RBCR;                              /**< Receive Bit Count, offset: 0xF8 */
  __I  uint32_t RBCTR;                             /**< Receive Bit Count Timestamp, offset: 0xFC */
  __IO uint32_t MCR;                               /**< MCLK Control, offset: 0x100 */
} SAI_Type, *SAI_MemMapPtr;

/** Number of instances of the SAI module. */
#define SAI_INSTANCE_COUNT                       (2u)

/* SAI - Peripheral instance base addresses */
/** Peripheral SAI_0 base address */
#define IP_SAI_0_BASE                            (0x402EC000u)
/** Peripheral SAI_0 base pointer */
#define IP_SAI_0                                 ((SAI_Type *)IP_SAI_0_BASE)
/** Peripheral SAI_1 base address */
#define IP_SAI_1_BASE                            (0x402F0000u)
/** Peripheral SAI_1 base pointer */
#define IP_SAI_1                                 ((SAI_Type *)IP_SAI_1_BASE)
/** Array initializer of SAI peripheral base addresses */
#define IP_SAI_BASE_ADDRS                        { IP_SAI_0_BASE, IP_SAI_1_BASE }
/** Array initializer of SAI peripheral base pointers */
#define IP_SAI_BASE_PTRS                         { IP_SAI_0, IP_SAI_1 }

/* ----------------------------------------------------------------------------
   -- SAI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SAI_Register_Masks SAI Register Masks
 * @{
 */

