zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SAI.h
#define SAI_TCR5_W0W_MASK                        (0x1F0000U)
#define SAI_TCR5_W0W_SHIFT                       (16U)
#define SAI_TCR5_W0W_WIDTH                       (5U)
#define SAI_TCR5_W0W(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCR5_W0W_SHIFT)) & SAI_TCR5_W0W_MASK)

#define SAI_TCR5_WNW_MASK                        (0x1F000000U)
#define SAI_TCR5_WNW_SHIFT                       (24U)
#define SAI_TCR5_WNW_WIDTH                       (5U)
#define SAI_TCR5_WNW(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TCR5_WNW_SHIFT)) & SAI_TCR5_WNW_MASK)
/*! @} */

/*! @name TDR - Transmit Data */
/*! @{ */

#define SAI_TDR_TDR_MASK                         (0xFFFFFFFFU)
#define SAI_TDR_TDR_SHIFT                        (0U)
#define SAI_TDR_TDR_WIDTH                        (32U)
#define SAI_TDR_TDR(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_TDR_TDR_SHIFT)) & SAI_TDR_TDR_MASK)
/*! @} */

/*! @name TFR - Transmit FIFO */
/*! @{ */

#define SAI_TFR_RFP_MASK                         (0xFU)
#define SAI_TFR_RFP_SHIFT                        (0U)
#define SAI_TFR_RFP_WIDTH                        (4U)
#define SAI_TFR_RFP(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_TFR_RFP_SHIFT)) & SAI_TFR_RFP_MASK)

#define SAI_TFR_WFP_MASK                         (0xF0000U)
#define SAI_TFR_WFP_SHIFT                        (16U)
#define SAI_TFR_WFP_WIDTH                        (4U)
#define SAI_TFR_WFP(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_TFR_WFP_SHIFT)) & SAI_TFR_WFP_MASK)

#define SAI_TFR_WCP_MASK                         (0x80000000U)
#define SAI_TFR_WCP_SHIFT                        (31U)
#define SAI_TFR_WCP_WIDTH                        (1U)
#define SAI_TFR_WCP(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_TFR_WCP_SHIFT)) & SAI_TFR_WCP_MASK)
/*! @} */

/*! @name TMR - Transmit Mask */
/*! @{ */

#define SAI_TMR_TWM_MASK                         (0xFFFFU)
#define SAI_TMR_TWM_SHIFT                        (0U)
#define SAI_TMR_TWM_WIDTH                        (16U)
#define SAI_TMR_TWM(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_TMR_TWM_SHIFT)) & SAI_TMR_TWM_MASK)
/*! @} */

/*! @name TTCR - Transmit Timestamp Control */
/*! @{ */

#define SAI_TTCR_TSEN_MASK                       (0x1U)
#define SAI_TTCR_TSEN_SHIFT                      (0U)
#define SAI_TTCR_TSEN_WIDTH                      (1U)
#define SAI_TTCR_TSEN(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_TTCR_TSEN_SHIFT)) & SAI_TTCR_TSEN_MASK)

#define SAI_TTCR_TSINC_MASK                      (0x2U)
#define SAI_TTCR_TSINC_SHIFT                     (1U)
#define SAI_TTCR_TSINC_WIDTH                     (1U)
#define SAI_TTCR_TSINC(x)                        (((uint32_t)(((uint32_t)(x)) << SAI_TTCR_TSINC_SHIFT)) & SAI_TTCR_TSINC_MASK)

#define SAI_TTCR_TSSEL_MASK                      (0xCU)
#define SAI_TTCR_TSSEL_SHIFT                     (2U)
#define SAI_TTCR_TSSEL_WIDTH                     (2U)
#define SAI_TTCR_TSSEL(x)                        (((uint32_t)(((uint32_t)(x)) << SAI_TTCR_TSSEL_SHIFT)) & SAI_TTCR_TSSEL_MASK)

#define SAI_TTCR_RTSC_MASK                       (0x100U)
#define SAI_TTCR_RTSC_SHIFT                      (8U)
#define SAI_TTCR_RTSC_WIDTH                      (1U)
#define SAI_TTCR_RTSC(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_TTCR_RTSC_SHIFT)) & SAI_TTCR_RTSC_MASK)

#define SAI_TTCR_RBC_MASK                        (0x200U)
#define SAI_TTCR_RBC_SHIFT                       (9U)
#define SAI_TTCR_RBC_WIDTH                       (1U)
#define SAI_TTCR_RBC(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TTCR_RBC_SHIFT)) & SAI_TTCR_RBC_MASK)
/*! @} */

/*! @name TTSR - Transmit Timestamp */
/*! @{ */

#define SAI_TTSR_TSC_MASK                        (0xFFFFFFFFU)
#define SAI_TTSR_TSC_SHIFT                       (0U)
#define SAI_TTSR_TSC_WIDTH                       (32U)
#define SAI_TTSR_TSC(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_TTSR_TSC_SHIFT)) & SAI_TTSR_TSC_MASK)
/*! @} */

/*! @name TBCR - Transmit Bit Count */
/*! @{ */

#define SAI_TBCR_BCNT_MASK                       (0xFFFFFFFFU)
#define SAI_TBCR_BCNT_SHIFT                      (0U)
#define SAI_TBCR_BCNT_WIDTH                      (32U)
#define SAI_TBCR_BCNT(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_TBCR_BCNT_SHIFT)) & SAI_TBCR_BCNT_MASK)
/*! @} */

/*! @name TBCTR - Transmit Bit Count Timestamp */
/*! @{ */

#define SAI_TBCTR_BCTS_MASK                      (0xFFFFFFFFU)
#define SAI_TBCTR_BCTS_SHIFT                     (0U)
#define SAI_TBCTR_BCTS_WIDTH                     (32U)
#define SAI_TBCTR_BCTS(x)                        (((uint32_t)(((uint32_t)(x)) << SAI_TBCTR_BCTS_SHIFT)) & SAI_TBCTR_BCTS_MASK)
/*! @} */

/*! @name RCSR - Receive Control */
/*! @{ */

#define SAI_RCSR_FRDE_MASK                       (0x1U)
#define SAI_RCSR_FRDE_SHIFT                      (0U)
#define SAI_RCSR_FRDE_WIDTH                      (1U)
#define SAI_RCSR_FRDE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FRDE_SHIFT)) & SAI_RCSR_FRDE_MASK)

#define SAI_RCSR_FWDE_MASK                       (0x2U)
#define SAI_RCSR_FWDE_SHIFT                      (1U)
#define SAI_RCSR_FWDE_WIDTH                      (1U)
#define SAI_RCSR_FWDE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FWDE_SHIFT)) & SAI_RCSR_FWDE_MASK)

#define SAI_RCSR_FRIE_MASK                       (0x100U)
#define SAI_RCSR_FRIE_SHIFT                      (8U)
#define SAI_RCSR_FRIE_WIDTH                      (1U)
#define SAI_RCSR_FRIE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FRIE_SHIFT)) & SAI_RCSR_FRIE_MASK)

#define SAI_RCSR_FWIE_MASK                       (0x200U)
#define SAI_RCSR_FWIE_SHIFT                      (9U)
#define SAI_RCSR_FWIE_WIDTH                      (1U)
#define SAI_RCSR_FWIE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FWIE_SHIFT)) & SAI_RCSR_FWIE_MASK)

#define SAI_RCSR_FEIE_MASK                       (0x400U)
#define SAI_RCSR_FEIE_SHIFT                      (10U)
#define SAI_RCSR_FEIE_WIDTH                      (1U)
#define SAI_RCSR_FEIE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FEIE_SHIFT)) & SAI_RCSR_FEIE_MASK)

