zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SAI.h
#define SAI_RCSR_SEIE_MASK                       (0x800U)
#define SAI_RCSR_SEIE_SHIFT                      (11U)
#define SAI_RCSR_SEIE_WIDTH                      (1U)
#define SAI_RCSR_SEIE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_SEIE_SHIFT)) & SAI_RCSR_SEIE_MASK)

#define SAI_RCSR_WSIE_MASK                       (0x1000U)
#define SAI_RCSR_WSIE_SHIFT                      (12U)
#define SAI_RCSR_WSIE_WIDTH                      (1U)
#define SAI_RCSR_WSIE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_WSIE_SHIFT)) & SAI_RCSR_WSIE_MASK)

#define SAI_RCSR_FRF_MASK                        (0x10000U)
#define SAI_RCSR_FRF_SHIFT                       (16U)
#define SAI_RCSR_FRF_WIDTH                       (1U)
#define SAI_RCSR_FRF(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FRF_SHIFT)) & SAI_RCSR_FRF_MASK)

#define SAI_RCSR_FWF_MASK                        (0x20000U)
#define SAI_RCSR_FWF_SHIFT                       (17U)
#define SAI_RCSR_FWF_WIDTH                       (1U)
#define SAI_RCSR_FWF(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FWF_SHIFT)) & SAI_RCSR_FWF_MASK)

#define SAI_RCSR_FEF_MASK                        (0x40000U)
#define SAI_RCSR_FEF_SHIFT                       (18U)
#define SAI_RCSR_FEF_WIDTH                       (1U)
#define SAI_RCSR_FEF(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FEF_SHIFT)) & SAI_RCSR_FEF_MASK)

#define SAI_RCSR_SEF_MASK                        (0x80000U)
#define SAI_RCSR_SEF_SHIFT                       (19U)
#define SAI_RCSR_SEF_WIDTH                       (1U)
#define SAI_RCSR_SEF(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_SEF_SHIFT)) & SAI_RCSR_SEF_MASK)

#define SAI_RCSR_WSF_MASK                        (0x100000U)
#define SAI_RCSR_WSF_SHIFT                       (20U)
#define SAI_RCSR_WSF_WIDTH                       (1U)
#define SAI_RCSR_WSF(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_WSF_SHIFT)) & SAI_RCSR_WSF_MASK)

#define SAI_RCSR_SR_MASK                         (0x1000000U)
#define SAI_RCSR_SR_SHIFT                        (24U)
#define SAI_RCSR_SR_WIDTH                        (1U)
#define SAI_RCSR_SR(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_SR_SHIFT)) & SAI_RCSR_SR_MASK)

#define SAI_RCSR_FR_MASK                         (0x2000000U)
#define SAI_RCSR_FR_SHIFT                        (25U)
#define SAI_RCSR_FR_WIDTH                        (1U)
#define SAI_RCSR_FR(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FR_SHIFT)) & SAI_RCSR_FR_MASK)

#define SAI_RCSR_BCE_MASK                        (0x10000000U)
#define SAI_RCSR_BCE_SHIFT                       (28U)
#define SAI_RCSR_BCE_WIDTH                       (1U)
#define SAI_RCSR_BCE(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_BCE_SHIFT)) & SAI_RCSR_BCE_MASK)

#define SAI_RCSR_DBGE_MASK                       (0x20000000U)
#define SAI_RCSR_DBGE_SHIFT                      (29U)
#define SAI_RCSR_DBGE_WIDTH                      (1U)
#define SAI_RCSR_DBGE(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_DBGE_SHIFT)) & SAI_RCSR_DBGE_MASK)

#define SAI_RCSR_RE_MASK                         (0x80000000U)
#define SAI_RCSR_RE_SHIFT                        (31U)
#define SAI_RCSR_RE_WIDTH                        (1U)
#define SAI_RCSR_RE(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_RE_SHIFT)) & SAI_RCSR_RE_MASK)
/*! @} */

/*! @name RCR1 - Receive Configuration 1 */
/*! @{ */

#define SAI_RCR1_RFW_MASK                        (0x7U)
#define SAI_RCR1_RFW_SHIFT                       (0U)
#define SAI_RCR1_RFW_WIDTH                       (3U)
#define SAI_RCR1_RFW(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR1_RFW_SHIFT)) & SAI_RCR1_RFW_MASK)
/*! @} */

/*! @name RCR2 - Receive Configuration 2 */
/*! @{ */

#define SAI_RCR2_DIV_MASK                        (0xFFU)
#define SAI_RCR2_DIV_SHIFT                       (0U)
#define SAI_RCR2_DIV_WIDTH                       (8U)
#define SAI_RCR2_DIV(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_DIV_SHIFT)) & SAI_RCR2_DIV_MASK)

#define SAI_RCR2_BYP_MASK                        (0x800000U)
#define SAI_RCR2_BYP_SHIFT                       (23U)
#define SAI_RCR2_BYP_WIDTH                       (1U)
#define SAI_RCR2_BYP(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_BYP_SHIFT)) & SAI_RCR2_BYP_MASK)

#define SAI_RCR2_BCD_MASK                        (0x1000000U)
#define SAI_RCR2_BCD_SHIFT                       (24U)
#define SAI_RCR2_BCD_WIDTH                       (1U)
#define SAI_RCR2_BCD(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_BCD_SHIFT)) & SAI_RCR2_BCD_MASK)

#define SAI_RCR2_BCP_MASK                        (0x2000000U)
#define SAI_RCR2_BCP_SHIFT                       (25U)
#define SAI_RCR2_BCP_WIDTH                       (1U)
#define SAI_RCR2_BCP(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_BCP_SHIFT)) & SAI_RCR2_BCP_MASK)

#define SAI_RCR2_MSEL_MASK                       (0xC000000U)
#define SAI_RCR2_MSEL_SHIFT                      (26U)
#define SAI_RCR2_MSEL_WIDTH                      (2U)
#define SAI_RCR2_MSEL(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_MSEL_SHIFT)) & SAI_RCR2_MSEL_MASK)

#define SAI_RCR2_BCI_MASK                        (0x10000000U)
#define SAI_RCR2_BCI_SHIFT                       (28U)
#define SAI_RCR2_BCI_WIDTH                       (1U)
#define SAI_RCR2_BCI(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_BCI_SHIFT)) & SAI_RCR2_BCI_MASK)

#define SAI_RCR2_SYNC_MASK                       (0x40000000U)
#define SAI_RCR2_SYNC_SHIFT                      (30U)
#define SAI_RCR2_SYNC_WIDTH                      (1U)
#define SAI_RCR2_SYNC(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_SYNC_SHIFT)) & SAI_RCR2_SYNC_MASK)
/*! @} */

/*! @name RCR3 - Receive Configuration 3 */
/*! @{ */

#define SAI_RCR3_WDFL_MASK                       (0xFU)
#define SAI_RCR3_WDFL_SHIFT                      (0U)
#define SAI_RCR3_WDFL_WIDTH                      (4U)
#define SAI_RCR3_WDFL(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCR3_WDFL_SHIFT)) & SAI_RCR3_WDFL_MASK)

