zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SAI.h
#define SAI_RCR3_RCE_MASK                        (0xF0000U)  /* Merged from fields with different position or width, of widths (2, 4), largest definition used */
#define SAI_RCR3_RCE_SHIFT                       (16U)
#define SAI_RCR3_RCE_WIDTH                       (4U)
#define SAI_RCR3_RCE(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR3_RCE_SHIFT)) & SAI_RCR3_RCE_MASK)  /* Merged from fields with different position or width, of widths (2, 4), largest definition used */

#define SAI_RCR3_CFR_MASK                        (0xF000000U)  /* Merged from fields with different position or width, of widths (2, 4), largest definition used */
#define SAI_RCR3_CFR_SHIFT                       (24U)
#define SAI_RCR3_CFR_WIDTH                       (4U)
#define SAI_RCR3_CFR(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR3_CFR_SHIFT)) & SAI_RCR3_CFR_MASK)  /* Merged from fields with different position or width, of widths (2, 4), largest definition used */
/*! @} */

/*! @name RCR4 - Receive Configuration 4 */
/*! @{ */

#define SAI_RCR4_FSD_MASK                        (0x1U)
#define SAI_RCR4_FSD_SHIFT                       (0U)
#define SAI_RCR4_FSD_WIDTH                       (1U)
#define SAI_RCR4_FSD(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FSD_SHIFT)) & SAI_RCR4_FSD_MASK)

#define SAI_RCR4_FSP_MASK                        (0x2U)
#define SAI_RCR4_FSP_SHIFT                       (1U)
#define SAI_RCR4_FSP_WIDTH                       (1U)
#define SAI_RCR4_FSP(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FSP_SHIFT)) & SAI_RCR4_FSP_MASK)

#define SAI_RCR4_ONDEM_MASK                      (0x4U)
#define SAI_RCR4_ONDEM_SHIFT                     (2U)
#define SAI_RCR4_ONDEM_WIDTH                     (1U)
#define SAI_RCR4_ONDEM(x)                        (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_ONDEM_SHIFT)) & SAI_RCR4_ONDEM_MASK)

#define SAI_RCR4_FSE_MASK                        (0x8U)
#define SAI_RCR4_FSE_SHIFT                       (3U)
#define SAI_RCR4_FSE_WIDTH                       (1U)
#define SAI_RCR4_FSE(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FSE_SHIFT)) & SAI_RCR4_FSE_MASK)

#define SAI_RCR4_MF_MASK                         (0x10U)
#define SAI_RCR4_MF_SHIFT                        (4U)
#define SAI_RCR4_MF_WIDTH                        (1U)
#define SAI_RCR4_MF(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_MF_SHIFT)) & SAI_RCR4_MF_MASK)

#define SAI_RCR4_SYWD_MASK                       (0x1F00U)
#define SAI_RCR4_SYWD_SHIFT                      (8U)
#define SAI_RCR4_SYWD_WIDTH                      (5U)
#define SAI_RCR4_SYWD(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_SYWD_SHIFT)) & SAI_RCR4_SYWD_MASK)

#define SAI_RCR4_FRSZ_MASK                       (0xF0000U)
#define SAI_RCR4_FRSZ_SHIFT                      (16U)
#define SAI_RCR4_FRSZ_WIDTH                      (4U)
#define SAI_RCR4_FRSZ(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FRSZ_SHIFT)) & SAI_RCR4_FRSZ_MASK)

#define SAI_RCR4_FPACK_MASK                      (0x3000000U)
#define SAI_RCR4_FPACK_SHIFT                     (24U)
#define SAI_RCR4_FPACK_WIDTH                     (2U)
#define SAI_RCR4_FPACK(x)                        (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FPACK_SHIFT)) & SAI_RCR4_FPACK_MASK)

#define SAI_RCR4_FCOMB_MASK                      (0xC000000U)
#define SAI_RCR4_FCOMB_SHIFT                     (26U)
#define SAI_RCR4_FCOMB_WIDTH                     (2U)
#define SAI_RCR4_FCOMB(x)                        (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FCOMB_SHIFT)) & SAI_RCR4_FCOMB_MASK)

#define SAI_RCR4_FCONT_MASK                      (0x10000000U)
#define SAI_RCR4_FCONT_SHIFT                     (28U)
#define SAI_RCR4_FCONT_WIDTH                     (1U)
#define SAI_RCR4_FCONT(x)                        (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FCONT_SHIFT)) & SAI_RCR4_FCONT_MASK)
/*! @} */

/*! @name RCR5 - Receive Configuration 5 */
/*! @{ */

#define SAI_RCR5_FBT_MASK                        (0x1F00U)
#define SAI_RCR5_FBT_SHIFT                       (8U)
#define SAI_RCR5_FBT_WIDTH                       (5U)
#define SAI_RCR5_FBT(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR5_FBT_SHIFT)) & SAI_RCR5_FBT_MASK)

#define SAI_RCR5_W0W_MASK                        (0x1F0000U)
#define SAI_RCR5_W0W_SHIFT                       (16U)
#define SAI_RCR5_W0W_WIDTH                       (5U)
#define SAI_RCR5_W0W(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR5_W0W_SHIFT)) & SAI_RCR5_W0W_MASK)

#define SAI_RCR5_WNW_MASK                        (0x1F000000U)
#define SAI_RCR5_WNW_SHIFT                       (24U)
#define SAI_RCR5_WNW_WIDTH                       (5U)
#define SAI_RCR5_WNW(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR5_WNW_SHIFT)) & SAI_RCR5_WNW_MASK)
/*! @} */

/*! @name RDR - Receive Data */
/*! @{ */

#define SAI_RDR_RDR_MASK                         (0xFFFFFFFFU)
#define SAI_RDR_RDR_SHIFT                        (0U)
#define SAI_RDR_RDR_WIDTH                        (32U)
#define SAI_RDR_RDR(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_RDR_RDR_SHIFT)) & SAI_RDR_RDR_MASK)
/*! @} */

/*! @name RFR - Receive FIFO */
/*! @{ */

#define SAI_RFR_RFP_MASK                         (0xFU)
#define SAI_RFR_RFP_SHIFT                        (0U)
#define SAI_RFR_RFP_WIDTH                        (4U)
#define SAI_RFR_RFP(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_RFR_RFP_SHIFT)) & SAI_RFR_RFP_MASK)

#define SAI_RFR_RCP_MASK                         (0x8000U)
#define SAI_RFR_RCP_SHIFT                        (15U)
#define SAI_RFR_RCP_WIDTH                        (1U)
#define SAI_RFR_RCP(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_RFR_RCP_SHIFT)) & SAI_RFR_RCP_MASK)

#define SAI_RFR_WFP_MASK                         (0xF0000U)
#define SAI_RFR_WFP_SHIFT                        (16U)
#define SAI_RFR_WFP_WIDTH                        (4U)
#define SAI_RFR_WFP(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_RFR_WFP_SHIFT)) & SAI_RFR_WFP_MASK)
/*! @} */

/*! @name RMR - Receive Mask */
/*! @{ */

#define SAI_RMR_RWM_MASK                         (0xFFFFU)
#define SAI_RMR_RWM_SHIFT                        (0U)
#define SAI_RMR_RWM_WIDTH                        (16U)
#define SAI_RMR_RWM(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_RMR_RWM_SHIFT)) & SAI_RMR_RWM_MASK)
/*! @} */

/*! @name RTCR - Receive Timestamp Control */
/*! @{ */

#define SAI_RTCR_TSEN_MASK                       (0x1U)
#define SAI_RTCR_TSEN_SHIFT                      (0U)
#define SAI_RTCR_TSEN_WIDTH                      (1U)
#define SAI_RTCR_TSEN(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RTCR_TSEN_SHIFT)) & SAI_RTCR_TSEN_MASK)

