zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SAI.h
#define SAI_RTCR_TSINC_MASK                      (0x2U)
#define SAI_RTCR_TSINC_SHIFT                     (1U)
#define SAI_RTCR_TSINC_WIDTH                     (1U)
#define SAI_RTCR_TSINC(x)                        (((uint32_t)(((uint32_t)(x)) << SAI_RTCR_TSINC_SHIFT)) & SAI_RTCR_TSINC_MASK)

#define SAI_RTCR_TSSEL_MASK                      (0xCU)
#define SAI_RTCR_TSSEL_SHIFT                     (2U)
#define SAI_RTCR_TSSEL_WIDTH                     (2U)
#define SAI_RTCR_TSSEL(x)                        (((uint32_t)(((uint32_t)(x)) << SAI_RTCR_TSSEL_SHIFT)) & SAI_RTCR_TSSEL_MASK)

#define SAI_RTCR_RTSC_MASK                       (0x100U)
#define SAI_RTCR_RTSC_SHIFT                      (8U)
#define SAI_RTCR_RTSC_WIDTH                      (1U)
#define SAI_RTCR_RTSC(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RTCR_RTSC_SHIFT)) & SAI_RTCR_RTSC_MASK)

#define SAI_RTCR_RBC_MASK                        (0x200U)
#define SAI_RTCR_RBC_SHIFT                       (9U)
#define SAI_RTCR_RBC_WIDTH                       (1U)
#define SAI_RTCR_RBC(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RTCR_RBC_SHIFT)) & SAI_RTCR_RBC_MASK)
/*! @} */

/*! @name RTSR - Receive Timestamp */
/*! @{ */

#define SAI_RTSR_TSC_MASK                        (0xFFFFFFFFU)
#define SAI_RTSR_TSC_SHIFT                       (0U)
#define SAI_RTSR_TSC_WIDTH                       (32U)
#define SAI_RTSR_TSC(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RTSR_TSC_SHIFT)) & SAI_RTSR_TSC_MASK)
/*! @} */

/*! @name RBCR - Receive Bit Count */
/*! @{ */

#define SAI_RBCR_BCNT_MASK                       (0xFFFFFFFFU)
#define SAI_RBCR_BCNT_SHIFT                      (0U)
#define SAI_RBCR_BCNT_WIDTH                      (32U)
#define SAI_RBCR_BCNT(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RBCR_BCNT_SHIFT)) & SAI_RBCR_BCNT_MASK)
/*! @} */

/*! @name RBCTR - Receive Bit Count Timestamp */
/*! @{ */

#define SAI_RBCTR_BCTS_MASK                      (0xFFFFFFFFU)
#define SAI_RBCTR_BCTS_SHIFT                     (0U)
#define SAI_RBCTR_BCTS_WIDTH                     (32U)
#define SAI_RBCTR_BCTS(x)                        (((uint32_t)(((uint32_t)(x)) << SAI_RBCTR_BCTS_SHIFT)) & SAI_RBCTR_BCTS_MASK)
/*! @} */

/*! @name MCR - MCLK Control */
/*! @{ */

#define SAI_MCR_DIV_MASK                         (0xFFU)
#define SAI_MCR_DIV_SHIFT                        (0U)
#define SAI_MCR_DIV_WIDTH                        (8U)
#define SAI_MCR_DIV(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_MCR_DIV_SHIFT)) & SAI_MCR_DIV_MASK)

#define SAI_MCR_DIVEN_MASK                       (0x800000U)
#define SAI_MCR_DIVEN_SHIFT                      (23U)
#define SAI_MCR_DIVEN_WIDTH                      (1U)
#define SAI_MCR_DIVEN(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_MCR_DIVEN_SHIFT)) & SAI_MCR_DIVEN_MASK)

#define SAI_MCR_MSEL_MASK                        (0x3000000U)
#define SAI_MCR_MSEL_SHIFT                       (24U)
#define SAI_MCR_MSEL_WIDTH                       (2U)
#define SAI_MCR_MSEL(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_MCR_MSEL_SHIFT)) & SAI_MCR_MSEL_MASK)

#define SAI_MCR_MOE_MASK                         (0x40000000U)
#define SAI_MCR_MOE_SHIFT                        (30U)
#define SAI_MCR_MOE_WIDTH                        (1U)
#define SAI_MCR_MOE(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_MCR_MOE_SHIFT)) & SAI_MCR_MOE_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group SAI_Register_Masks */

/*!
 * @}
 */ /* end of group SAI_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_SAI_H_) */
